Mindtribe/Leash-Debugger/leash/src/target/cc3200/cc3200_core.c
/*  ------------------------------------------------------------
    Copyright(C) 2015 MindTribe Product Engineering, Inc.
    All Rights Reserved.

    Author:     Sander Vocke, MindTribe Product Engineering
                <sander@mindtribe.com>

    Target(s):  ISO/IEC 9899:1999 (TI CC3200 - Launchpad XL)
    --------------------------------------------------------- */

#include "cc3200_core.h"

#include "log.h"
#include "cc3200_jtagdp.h"
#include "error.h"

//properties to check
#define CC3200_CORE_AP_IDR 0x24770011
#define CC3200_CORE_COMPID 0xB105100D
#define CC3200_CORE_PERID 0x4000bb4c4

//AP addresses
#define CC3200_CORE_AP_CSW_ADDR 0x00
#define CC3200_CORE_AP_TRANSFERADDR_ADDR 0x04
#define CC3200_CORE_AP_BD0_ADDR 0x10
#define CC3200_CORE_AP_BD1_ADDR 0x14
#define CC3200_CORE_AP_BD2_ADDR 0x18
#define CC3200_CORE_AP_BD3_ADDR 0x1C
#define CC3200_CORE_AP_DATARW_ADDR 0x0C
#define CC3200_CORE_AP_CFG_ADDR 0xF4
#define CC3200_CORE_AP_BASE_ADDR 0xF8
#define CC3200_CORE_AP_IDR_ADDR 0xFC

//bitmasks in control/status register
#define CC3200_CORE_CSW_DBGSWENABLE (1<<31)
#define CC3200_CORE_CSW_PROT_OFFSET (24)
#define CC3200_CORE_CSW_PROT_MASK (0x7F << CC3200_CORE_CSW_PROT_OFFSET)
#define CC3200_CORE_CSW_SPIDEN (1<<23)
#define CC3200_CORE_CSW_MODE_OFFSET (8)
#define CC3200_CORE_CSW_MODE_MASK (0xF << CC3200_CORE_CSW_MODE_OFFSET)
#define CC3200_CORE_CSW_TRINPROG (1<<7)
#define CC3200_CORE_CSW_DEVICEEN (1<<6)
#define CC3200_CORE_CSW_ADDRINC_OFFSET (4)
#define CC3200_CORE_CSW_ADDRINC_MASK (0x3 << CC3200_CORE_CSW_ADDRINC_OFFSET)
#define CC3200_CORE_CSW_SIZE_OFFSET (0)
#define CC3200_CORE_CSW_SIZE_MASK (0x7 << CC3200_CORE_CSW_SIZE_OFFSET)

//settings in control/status register
#define CC3200_CORE_CSW_ADDRINC_SINGLE (1 << CC3200_CORE_CSW_ADDRINC_OFFSET)

//addresses relative to DEBUG_BASE
#define CC3200_CORE_BASEOFFSET_COMPID0 0xFF0
#define CC3200_CORE_BASEOFFSET_COMPID1 0xFF4
#define CC3200_CORE_BASEOFFSET_COMPID2 0xFF8
#define CC3200_CORE_BASEOFFSET_COMPID3 0xFFC
#define CC3200_CORE_BASEOFFSET_PERID0 0xFE0
#define CC3200_CORE_BASEOFFSET_PERID1 0xFE4
#define CC3200_CORE_BASEOFFSET_PERID2 0xFE8
#define CC3200_CORE_BASEOFFSET_PERID3 0xFEC
#define CC3200_CORE_BASEOFFSET_PERID4 0xFD0
#define CC3200_CORE_BASEOFFSET_MEMTYPE 0xFCC

//SCS
#define CC3200_CORE_MEM_AIRCR 0xD0C
#define CC3200_CORE_MEM_DFSR 0xD30
#define CC3200_CORE_MEM_DHCSR 0xDF0
#define CC3200_CORE_MEM_DCRSR 0xDF4
#define CC3200_CORE_MEM_DCRDR 0xDF8
#define CC3200_CORE_MEM_DEMCR 0xDFC

//DHCSR bitmasks
#define CC3200_CORE_MEM_DHCSR_C_DEBUGEN (1<<0)
#define CC3200_CORE_MEM_DHCSR_C_HALT (1<<1)
#define CC3200_CORE_MEM_DHCSR_C_STEP (1<<2)
#define CC3200_CORE_MEM_DHCSR_S_REGRDY (1<<16)
#define CC3200_CORE_MEM_DHCSR_S_HALT (1<<17)
#define CC3200_CORE_MEM_DHCSR_DBGKEY_OFFSET 16
#define CC3200_CORE_MEM_DHCSR_DBGKEY_MASK (0xFFFF<<CC3200_CORE_MEM_DHCSR_DBGKEY_OFFSET)

//DEMCR bitmasks
#define CC3200_CORE_MEM_DEMCR_VC_CORERESET (1)

//AIRCR bitmasks
#define CC3200_CORE_MEM_AIRCR_VECTRESET (1)
#define CC3200_CORE_MEM_AIRCR_KEY_OFFSET 16
#define CC3200_CORE_MEM_AIRCR_KEY_MASK (0xFFFF<<CC3200_CORE_MEM_AIRCR_KEY_MASK)

//DCRSR bitmasks
#define CC3200_CORE_MEM_DCRSR_REGWNR (1<<16)
#define CC3200_CORE_MEM_REGSEL_MASK 0x1F

//DFSR bitmasks
#define CC3200_CORE_DFSR_BKPT (1<<1)

//misc

//"keys" to unlock certain core register writes
#define CC3200_CORE_KEY_DFSR 0xA05F //debug control
#define CC3200_CORE_KEY_AIRCR 0x05FA //reset control

#define CC3200_CORE_CSW_SIZE_WORD 0x02 //this setting of SIZE bits in MEM-AP CSW enables 32-bit memory accesses.

//ROM table
struct cc3200_core_romtable_entry{
    uint8_t valid;
    uint32_t address;
};

struct cc3200_core_state_t{
    int initialized;
    int detected;

    //misc properties
    uint32_t AP_IDR;
    uint32_t debug_base_addr;
    uint8_t debug_entry_present;
    uint8_t device_enabled;
    uint8_t secure_priv_enabled;
    uint8_t debug_sw_enabled;
    uint8_t access_size;
    uint8_t is_big_endian;
    uint32_t system_memory_present;

    //Identification
    uint32_t compID;
    uint64_t perID;

    //ROM table
    uint8_t has_rom_table;
    uint32_t rom_table_size;
    struct cc3200_core_romtable_entry romtable[1023];

    //debug features (have entries in ROM table)
    uint8_t has_scs;
    uint8_t has_dwt;
    uint8_t has_fpb;
    uint8_t has_itm;
    uint8_t has_tpiu;
    uint8_t has_etm;
    uint32_t scs_addr;
    uint32_t dwt_addr;
    uint32_t fpb_addr;
    uint32_t itm_addr;
    uint32_t tpiu_addr;
    uint32_t etm_addr;

    //debug status
    uint8_t halted;
};

//disable GCC warning - braces bug 53119 in GCC
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-braces"
struct cc3200_core_state_t cc3200_core_state = {
    .initialized = 0,
    .detected = 0,
    .AP_IDR = 0,
    .debug_base_addr = 0,
    .device_enabled = 0,
    .secure_priv_enabled = 0,
    .debug_sw_enabled = 0,
    .has_rom_table = 0,
    .debug_entry_present = 0,
    .is_big_endian = 0,
    .compID = 0,
    .rom_table_size = 0,
    .system_memory_present = 0,
    .access_size = 0,
    .perID = 0,
    .has_scs = 0,
    .has_dwt = 0,
    .has_fpb = 0,
    .has_itm = 0,
    .has_tpiu = 0,
    .has_etm = 0,
    .scs_addr = 0,
    .dwt_addr = 0,
    .fpb_addr = 0,
    .itm_addr = 0,
    .tpiu_addr = 0,
    .etm_addr = 0,
    .romtable = {0},
    .halted = 0
};
#pragma GCC diagnostic pop

int cc3200_core_deinit(void)
{
    cc3200_core_state.initialized = 0;
    return RET_SUCCESS;
}

int cc3200_core_init(void)
{
    if(cc3200_core_state.initialized) {return RET_SUCCESS;}

    cc3200_core_state.initialized = 1;
    return RET_SUCCESS;
}

int cc3200_core_detect(void)
{
    cc3200_core_state.detected = 0;
    if(!cc3200_core_state.initialized) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_core_read_APreg(0, CC3200_CORE_AP_IDR_ADDR, &cc3200_core_state.AP_IDR, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP read fail");}
    if(cc3200_core_state.AP_IDR != CC3200_CORE_AP_IDR) {RETURN_ERROR(ERROR_UNKNOWN, "ID reg fail");}

    uint32_t csw;
    if(cc3200_core_read_APreg(0, CC3200_CORE_AP_CSW_ADDR, &csw, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP read fail");}

