Mindtribe/Leash-Debugger/leash/src/target/cc3200/cc3200_core.c
    if(cc3200_core_write_APreg(0, CC3200_CORE_AP_CSW_ADDR,
            (csw & ~(CC3200_CORE_CSW_SIZE_MASK)) | CC3200_CORE_CSW_SIZE_WORD //word-size accesses
            | (CC3200_CORE_CSW_ADDRINC_SINGLE) //auto-increment address (for pipelined accesses)
            , 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP write fail");}

    if(cc3200_core_read_APreg(0, CC3200_CORE_AP_CSW_ADDR, &csw, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP read fail");}

    cc3200_core_state.device_enabled = (csw & CC3200_CORE_CSW_DEVICEEN) ? 1 : 0;
    cc3200_core_state.secure_priv_enabled = (csw & CC3200_CORE_CSW_SPIDEN) ? 1 : 0;
    cc3200_core_state.debug_sw_enabled = (csw & CC3200_CORE_CSW_DBGSWENABLE) ? 1 : 0;
    cc3200_core_state.access_size = (csw & CC3200_CORE_CSW_SIZE_MASK);

    uint32_t cfg;
    if(cc3200_core_read_APreg(0, CC3200_CORE_AP_CFG_ADDR, &cfg, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP read fail");}

    cc3200_core_state.is_big_endian = (cfg & 1);

    if(!cc3200_core_state.device_enabled) {RETURN_ERROR(ERROR_UNKNOWN, "Deviceen fail");}

    cc3200_core_state.detected = 1;
    return RET_SUCCESS;
}

int cc3200_core_read_APreg(uint8_t ap, uint8_t regaddr, uint32_t* result, uint8_t check_response)
{
    if(!cc3200_core_state.initialized) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_jtagdp_selectAPBank(ap, (regaddr>>4) & 0xF) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP Bank sel fail");}
    if(cc3200_jtagdp_APACC_read(regaddr & 0xF, result, check_response) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "APACC read fail");}

    return RET_SUCCESS;
}

int cc3200_core_write_APreg(uint8_t ap, uint8_t regaddr, uint32_t value, uint8_t check_response)
{
    if(!cc3200_core_state.initialized) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_jtagdp_selectAPBank(ap, (regaddr>>4) & 0xF) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP Bank sel fail");}
    if(cc3200_jtagdp_APACC_write(regaddr & 0xF, value, check_response) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "APACC write fail");}

    return RET_SUCCESS;
}

int cc3200_core_pipeline_write_APreg(uint8_t ap, uint8_t regaddr, uint32_t len, uint32_t *values)
{
    if(!cc3200_core_state.initialized) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_jtagdp_selectAPBank(ap, (regaddr>>4) & 0xF) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP Bank sel fail");}
    if(cc3200_jtagdp_APACC_pipeline_write(regaddr & 0xF, len, values, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "APACC pipe write fail");}

    return RET_SUCCESS;
}

int cc3200_core_pipeline_read_APreg(uint8_t ap, uint8_t regaddr, uint32_t len, uint32_t *dst)
{
    if(!cc3200_core_state.initialized) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_jtagdp_selectAPBank(ap, (regaddr>>4) & 0xF) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP Bank sel fail");}
    if(cc3200_jtagdp_APACC_pipeline_read(regaddr & 0xF, len, dst) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "APACC pipe read fail");}

    return RET_SUCCESS;
}

int cc3200_core_read_mem_addr(uint32_t addr, uint32_t* result)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_core_write_APreg(0,CC3200_CORE_AP_TRANSFERADDR_ADDR,addr & 0xFFFFFFF0, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP write fail");}
    if(cc3200_core_read_APreg(0,CC3200_CORE_AP_BD0_ADDR + (addr&0xC),result, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP read fail");}

    return RET_SUCCESS;
}

int cc3200_core_pipeline_write_mem_addr(uint32_t addr, uint32_t len, uint32_t* values)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    uint32_t next_kb_boundary = (addr&0xFFFFFC00)+0x400;
    uint32_t chunk_words = (next_kb_boundary - addr)/4;
    uint32_t cur_addr = addr;
    uint32_t *cur_val = values;
    uint32_t words_left = len;
    if(words_left<chunk_words) { chunk_words = words_left; }

    while(cur_addr < (addr+len*4)){
        if(cc3200_core_write_APreg(0,CC3200_CORE_AP_TRANSFERADDR_ADDR,cur_addr, 0) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP write fail");}
        if(cc3200_core_pipeline_write_APreg(0,CC3200_CORE_AP_DATARW_ADDR,chunk_words,cur_val) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP pipe write fail");}
        cur_addr += chunk_words*4;
        next_kb_boundary += 0x400;
        words_left -= chunk_words;
        cur_val += chunk_words;
        chunk_words = (next_kb_boundary - cur_addr)/4;
        if(words_left<chunk_words) { chunk_words = words_left; }
    }

    return RET_SUCCESS;
}

int cc3200_core_pipeline_read_mem_addr(uint32_t addr, uint32_t len, uint32_t *dst)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    uint32_t next_kb_boundary = (addr&0xFFFFFC00)+0x400;
    uint32_t chunk_words = (next_kb_boundary - addr)/4;
    uint32_t cur_addr = addr;
    uint32_t *cur_dst = dst;
    uint32_t words_left = len;
    if(words_left<chunk_words) { chunk_words = words_left; }

    while(cur_addr < (addr+len*4)){
        if(cc3200_core_write_APreg(0,CC3200_CORE_AP_TRANSFERADDR_ADDR,cur_addr, 0) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP write fail");}
        if(cc3200_core_pipeline_read_APreg(0,CC3200_CORE_AP_DATARW_ADDR,chunk_words,cur_dst) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP pipe read fail");}
        cur_addr += chunk_words*4;
        next_kb_boundary += 0x400;
        words_left -= chunk_words;
        cur_dst += chunk_words;
        chunk_words = (next_kb_boundary - cur_addr)/4;
        if(words_left<chunk_words) { chunk_words = words_left; }
    }

    return RET_SUCCESS;
}

int cc3200_core_write_mem_addr(uint32_t addr, uint32_t value)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_core_write_APreg(0,CC3200_CORE_AP_TRANSFERADDR_ADDR,addr & 0xFFFFFFF0, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP write fail");}
    if(cc3200_core_write_APreg(0,CC3200_CORE_AP_BD0_ADDR + (addr&0xC),value, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP write fail");}

    return RET_SUCCESS;
}

int cc3200_core_debug_halt(void)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            (CC3200_CORE_KEY_DFSR << CC3200_CORE_MEM_DHCSR_DBGKEY_OFFSET) |
            (CC3200_CORE_MEM_DHCSR_C_DEBUGEN) |
            CC3200_CORE_MEM_DHCSR_C_HALT) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    uint32_t temp;
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            &temp) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(!(temp & CC3200_CORE_MEM_DHCSR_S_HALT)) {RETURN_ERROR(temp, "CC3200: Halt fail");}

    cc3200_core_state.halted = 1;

    return RET_SUCCESS;
}

