Mindtribe/Leash-Debugger/leash/src/target/cc3200/cc3200_core.c
int cc3200_core_debug_reset_halt(void)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected || !cc3200_core_state.halted) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    uint32_t demcr;
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DEMCR,
            &demcr) == RET_FAILURE) {
        RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");
    }
    demcr |= CC3200_CORE_MEM_DEMCR_VC_CORERESET; //set reset debug trap flag
    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DEMCR,
            demcr) == RET_FAILURE) {
        RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");
    }

    //request a local core reset
    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_AIRCR,
            (CC3200_CORE_KEY_AIRCR << CC3200_CORE_MEM_AIRCR_KEY_OFFSET) |
            (CC3200_CORE_MEM_AIRCR_VECTRESET)) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    uint8_t halted = 0;
    while(!halted){
        if(cc3200_core_poll_halted(&halted) == RET_FAILURE){
            RETURN_ERROR(ERROR_UNKNOWN, "Halt poll fail");
        }
    }

    return RET_SUCCESS;
}

int cc3200_core_debug_step(void)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}
    if(!cc3200_core_state.halted) {RETURN_ERROR(ERROR_UNKNOWN, "Not halted fail");}

    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            (CC3200_CORE_KEY_DFSR << CC3200_CORE_MEM_DHCSR_DBGKEY_OFFSET) |
            (CC3200_CORE_MEM_DHCSR_C_DEBUGEN) |
            CC3200_CORE_MEM_DHCSR_C_STEP) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    uint32_t temp;
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            &temp) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(!(temp & CC3200_CORE_MEM_DHCSR_S_HALT)) {RETURN_ERROR(temp, "Halt fail");}

    cc3200_core_state.halted = 1;

    return RET_SUCCESS;
}

int cc3200_core_debug_continue(void)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}
    if(!cc3200_core_state.halted) {RETURN_ERROR(ERROR_UNKNOWN, "Not halted fail");}

    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            (CC3200_CORE_KEY_DFSR << CC3200_CORE_MEM_DHCSR_DBGKEY_OFFSET) |
            (CC3200_CORE_MEM_DHCSR_C_DEBUGEN)) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    uint32_t temp;
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            &temp) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}

    cc3200_core_state.halted = 0;

    return RET_SUCCESS;
}

int cc3200_core_debug_enable(void)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}

    //get debug space base address
    if(cc3200_core_read_APreg(0, CC3200_CORE_AP_BASE_ADDR, &cc3200_core_state.debug_base_addr, 1) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "AP read fail");}
    cc3200_core_state.debug_entry_present = cc3200_core_state.debug_base_addr & 1;
    cc3200_core_state.debug_base_addr &= 0xFFFFF000;

    //read component and peripheral ID's
    uint32_t compID[4]; //temp
    uint32_t perID[5]; //temp
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_COMPID0,
            &(compID[0])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_COMPID1,
            &(compID[1])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_COMPID2,
            &(compID[2])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_COMPID3,
            &(compID[3])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_PERID0,
            &(perID[0])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_PERID1,
            &(perID[1])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_PERID2,
            &(perID[2])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_PERID3,
            &(perID[3])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_PERID4,
            &(perID[4])) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}

    cc3200_core_state.compID = compID[0] | compID[1]<<8 | compID[2]<<16 | compID[3]<<24;
    cc3200_core_state.perID = perID[0] | perID[1]<<8 | perID[2]<<16 | perID[3]<<24 | ((uint64_t)perID[4])<<32;



    //check the component ID's
    if(cc3200_core_state.compID != CC3200_CORE_COMPID) {RETURN_ERROR(cc3200_core_state.compID, "compID mismatch.");}
    if(cc3200_core_state.perID != CC3200_CORE_PERID) {RETURN_ERROR(cc3200_core_state.perID, "perID mismatch.");}


    //check whether system memory is accessible.
    if(cc3200_core_read_mem_addr(cc3200_core_state.debug_base_addr + CC3200_CORE_BASEOFFSET_MEMTYPE,
            &cc3200_core_state.system_memory_present) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}



    //read ROM table
    uint32_t temp_entry;
    uint32_t cur_addr = 0;

    cur_addr = cc3200_core_state.debug_base_addr;
    cc3200_core_state.has_rom_table = 0;

    for(int i=0; i<1023; i++){
        if(cc3200_core_read_mem_addr(cur_addr, &temp_entry) == RET_FAILURE) {RETURN_ERROR(cur_addr, "ROM read fail");}
        cc3200_core_state.romtable[i].valid = temp_entry&1;
        if(!cc3200_core_state.romtable[i].valid || (temp_entry == 0)){
            LOG(LOG_VERBOSE, "[CC3200 CORE] Number of ROM table entries found: %d", i);
            break;
        }
        if(i>0) {cc3200_core_state.has_rom_table = 1; }//have read at least 1 valid entry
        uint32_t minus_offset = (uint32_t)(-1*((int)(temp_entry&0xFFFFF000))); //make positive, unsigned
        cc3200_core_state.romtable[i].address = cc3200_core_state.debug_base_addr - minus_offset;

        cur_addr += 4;
    }

    //some checks
    if(!cc3200_core_state.has_rom_table) {RETURN_ERROR(ERROR_UNKNOWN, "ROM table fail");} //cc3200 should have a ROM table.
    if((cc3200_core_state.has_scs = cc3200_core_state.romtable[0].valid) != 0) {cc3200_core_state.scs_addr = cc3200_core_state.romtable[0].address;   }
    if((cc3200_core_state.has_dwt = cc3200_core_state.romtable[1].valid) != 0) {cc3200_core_state.dwt_addr = cc3200_core_state.romtable[1].address;   }
    if((cc3200_core_state.has_fpb = cc3200_core_state.romtable[2].valid) != 0) {cc3200_core_state.fpb_addr = cc3200_core_state.romtable[2].address;   }
    if((cc3200_core_state.has_itm = cc3200_core_state.romtable[3].valid) != 0) {cc3200_core_state.itm_addr = cc3200_core_state.romtable[3].address;   }
    if((cc3200_core_state.has_tpiu = cc3200_core_state.romtable[4].valid) != 0){cc3200_core_state.tpiu_addr = cc3200_core_state.romtable[4].address; }
    if((cc3200_core_state.has_etm = cc3200_core_state.romtable[5].valid) != 0) {cc3200_core_state.etm_addr = cc3200_core_state.romtable[5].address;   }


