Mindtribe/Leash-Debugger/leash/src/target/cc3200/cc3200_core.c
    //unlock debugging using the debug key
    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            CC3200_CORE_KEY_DFSR << CC3200_CORE_MEM_DHCSR_DBGKEY_OFFSET) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}
    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            (CC3200_CORE_KEY_DFSR << CC3200_CORE_MEM_DHCSR_DBGKEY_OFFSET) |
            CC3200_CORE_MEM_DHCSR_C_DEBUGEN) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    uint32_t temp;
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            &temp) == RET_FAILURE){
        RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");
    }
    if(!(temp & CC3200_CORE_MEM_DHCSR_C_DEBUGEN)){
        RETURN_ERROR(temp, "Debug enable fail");
    }

    return RET_SUCCESS;
}

uint32_t cc3200_core_get_debug_base(void)
{
    return cc3200_core_state.debug_base_addr;
}

int cc3200_core_read_reg(enum cc3200_reg_index reg, uint32_t* dst)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "Not init fail");}
    if(!cc3200_core_state.halted) {RETURN_ERROR(ERROR_UNKNOWN, "Not halt fail");} //must be halted to read a register

    uint32_t regnum = (uint32_t) reg;

    //select the register
    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DCRSR,
            regnum & CC3200_CORE_MEM_REGSEL_MASK) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    //wait for the transaction to finish
    uint32_t dhcsr = 0;
    int i;
    for(i=0; i<100 && !(dhcsr & CC3200_CORE_MEM_DHCSR_S_REGRDY); i++){
        if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR, &dhcsr)
                == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    }
    if(i>=100) {RETURN_ERROR(ERROR_UNKNOWN, "Reg read fail");}

    //read the result out
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DCRDR, dst)
            == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}

    return RET_SUCCESS;
}

int cc3200_core_write_reg(enum cc3200_reg_index reg, uint32_t value)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}
    if(!cc3200_core_state.halted) {RETURN_ERROR(ERROR_UNKNOWN, "Not halt fail");} //must be halted to access a register

    uint32_t regnum = (uint32_t) reg;

    //prepare the data
    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DCRDR, value)
            == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    //select the register and initialize the transaction
    if(cc3200_core_write_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DCRSR,
            (regnum & CC3200_CORE_MEM_REGSEL_MASK) | CC3200_CORE_MEM_DCRSR_REGWNR) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem write fail");}

    //wait for the transaction to finish
    uint32_t dhcsr;
    for(int i=0; i<100; i++){
        if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR, &dhcsr)
                == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
        if((dhcsr & CC3200_CORE_MEM_DHCSR_S_REGRDY)) {return RET_SUCCESS;}
    }

    return RET_FAILURE;
}

int cc3200_core_set_pc(uint32_t addr)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}
    if(!cc3200_core_state.halted) {RETURN_ERROR(ERROR_UNKNOWN, "Not halt fail");}

    return cc3200_core_write_reg(CC3200_REG_PC, addr);
}

int cc3200_core_get_pc(uint32_t *dst)
{
    if(!cc3200_core_state.initialized || !cc3200_core_state.detected) {RETURN_ERROR(ERROR_UNKNOWN, "CC3200 not init");}
    if(!cc3200_core_state.halted) {RETURN_ERROR(ERROR_UNKNOWN, "Not halt fail");}

    return cc3200_core_read_reg(CC3200_REG_PC, dst);
}

int cc3200_core_poll_halted(uint8_t *result)
{
    uint32_t temp;
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DHCSR,
            &temp) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    if(temp & CC3200_CORE_MEM_DHCSR_S_HALT){
        *result = cc3200_core_state.halted = 1;
    }
    else{
        *result = cc3200_core_state.halted = 0;
    }

    return RET_SUCCESS;
}

int cc3200_core_getDFSR(uint32_t *result)
{
    if(cc3200_core_read_mem_addr(cc3200_core_state.scs_addr + CC3200_CORE_MEM_DFSR,
            result) == RET_FAILURE) {RETURN_ERROR(ERROR_UNKNOWN, "Mem read fail");}
    return RET_SUCCESS;
}
